/* Задача 1.
Определить индекс второй подстроки 'date' у переменной string.
Код должен работать на 2 тестах
1-ый тест
let string = 'date 10.10.10 date 20.20.20 date 30.30.30' 
14    

2-ой тест
let string = '10.10.10 date 20.20.20 date 30.30.30 date'   
23


console.log(string.indexOf('date', 11))
 */

//--------------------------------------------------------
  //method replace - Заменяет одну подстроку на другую

//   let string = "Hello main freunde"

//   console.log(string.replace('main', 'other'));


// Другие простые методы

/* let string = '  some   '

console.log(string.trim); // trimStart & trimEnd */

// Задан массив phones
// Сформируйте новый массив newPhones. 
// Если телефон начинается на +7 - он должен оказаться в новом массиве

// Пример:
// let phones = ['+7975644911','8975644944','+7975644999','+7975644945']

// Результат:
// ['+7975644911','+7975644999','+7975644945']

/* let phones = ['+7975644911','8975644944','+7975644999','+7975644945']

let newPhones = []

for (let elem of phones) {
    if (elem.includes('+7')) {
        // console.log(elem);
        newPhones += elem
    }
}

console.log(newPhones); */

// Задан массив phones, передающий номера телефонов в виде строки.
// Реализуйте очистку данных, сформировав единый вид для все элементов массива.phones

// Пример:
/* let phones = ['891 11112 233','89181-1122-44','8911-11122-44','89111112244']

// Результат:

// ['+79111112233','+79111112244','+79111112244','+79111112244']

for (let i = 0; i < phones; i++) {
    
    phones[i] = phones.('8', '+7');
    console.log(phones[i]);   
}

 */